## Plan Result (account-data-deleter-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246879)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07 must be replaced
-/+ resource "aws_ecs_task_definition" "data-deleter-app_application_ecs_service_ecs-task_243DED07" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:534" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      - {
                          - name  = "AWS_XRAY_CONTEXT_MISSING"
                          - value = "IGNORE_ERROR"
                        },
                      - {
                          - name  = "AWS_XRAY_LOG_LEVEL"
                          - value = "silent"
                        },
                        {
                            name  = "DATABASE_READ_PORT"
                            value = "3306"
                        },
                        # (4 unchanged elements hidden)
                    ]
                    name                   = "app"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "AccountDataDeleter-Prod" -> (known after apply)
      ~ revision                 = 534 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn                                                                              = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:534" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"75e3c655-564b-4fb9-84d0-69071d77d1ec","JobName":"account-data-deleter_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"5a5c4b0f44bcc66736fd3b4fcaae8c563f15f22b","Target":"account-data-deleter-cdk","Vars":{}} -->